OpenFOAM/ESIOF/tutorials/forwardStep/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// libs
// (
//     "liblduSolvers.so"
// )

application     sonicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.002;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep   no;
maxCo            10;

functions
{
    // Mach
    // {
    //     type        MachNumber;
    //     UName       U;

    //     functionObjectLibs ("libutilityFunctionObjects.so");
    // }

    // minMaxU
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name U;
    // }

    // minMaxP
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name p;
    // }

    // minMaxRho
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name rho;
    // }

    // minMaxT
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name T;
    // }
}


// ************************************************************************* //
